package 객체;

public class 설명 {
	
/*
 상수 : 변하지 않는 수 (final 사용) 
 객체 : 객체(Object)란 물리적으로 존재하거나 추상적으로 생각할 수 있는 것
 객체지향 프로그래밍 : 현실 세계를 모델링하여 소프트웨어 개발 
 
 붕어빵틀 : 클래스
 붕어빵 : 인스턴스 
 
 객체: 클래스로부터 생성된 인스턴스 
 -> 변수 : 기본 자료형의 생성자, 인스턴스: 클래스로부터 생성( new 키워드 사용)
 
 인스턴스 생성방법
 [자료형] [인스턴스명] = new [생성자];
 -> 자료형에는 클래스명이 올 수 있다. 
 String str = new String(); 

var a = 10; 지역 변수인 타입추론변수는 클래스 구간에선 사용 할 수 없다.

영역 ( 1. 멤버 변수 , 2. 메서드, 3. 생성자) 
1. 멤버변수 (필드영역 내에 존재)
-> 클래스변수 : 클래스를 사용하지 않고 바로 사용할 수 있는 변수
     인스턴스 변수 : new 클래스를 사용하여 인스턴스를 생성한 뒤에 사용할 수 있는 변수 
	 */
	

    // 필드 영역  끝
   //메서드 영역 시작 
	public void sayHello() {
		
	}
	//생성자 영역 시작 
	public 설명() {
		
	}
}
